export default {
    success: {
        title: 'สำเร็จ',
        login: 'เข้าสู่ระบบสำเร็จ',
        add: 'เพิ่มข้อมูลสำเร็จ',
        edit: 'แก้ไขข้อมูลสำเร็จ',
        delete: 'ลบข้อมูลสำเร็จ',
        save: 'บันทึกข้อมูลสำเร็จ'
    },
    error: {
        title: 'เกิดข้อผิดพลาด',
        subtitle: 'เกิดข้อพิดพลาด กรุณาลองใหม่อีกครั้ง',
        login: 'เข้าสู่ระบบล้มเหลว กรุณาตรวจสอบข้อมูลของคุณ.',
        add: 'ไม่สามารถเพิ่มข้อมูลได้ กรุณาลองใหม่.',
        edit: 'ไม่สามารถแก้ไขข้อมูลได้ กรุณาลองใหม่.',
        delete: 'ไม่สามารถลบข้อมูลได้ กรุณาลองใหม่.',
        required_field: 'กรุณากรอกข้อมูลให้ครบถ้วน',
        not_found: 'ไม่พบข้อมูล',
        save: 'บันทึกไม่สำเร็จ'
    },
    warning:{
        title: 'คำเตือน',
    },
    confirm: {
        save: 'คุณต้องการบันทึกการเปลี่ยนแปลงใช่หรือไม่?',
        discard_change: 'คุณต้องการยกเลิกการเปลี่ยนแปลงใช่หรือไม่?'
    },
    selected:{
        pleaseSelect: 'กรุณาเลือก',
        pleaseSelectOrder: 'กรุณาเลือกออเดอร์ที่จะตรวจสอบ',
        pleaseSelectOrderUn: 'กรุณาเลือกออเดอร์ที่จะยกเลิกการตรวจสอบ',
    },
    alertToast:{
        success: 'สำเร็จ',
        error: 'เกิดข้อผิดพลาด',
        warning: 'คำเตือน',
        info: 'ข้อมูล',
    },
};
